zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_mdf.h
/** @defgroup MDF_SadSoundTriggerEvent MDF sound activity detector trigger event
  * @{
  */
#define MDF_SAD_ENTER_DETECT       0x00000000U       /*!< Event when SAD enters in detect state */
#define MDF_SAD_ENTER_EXIT_DETECT  MDF_SADCR_DETCFG  /*!< Event when SAD enters or exits from detect state */
/**
  * @}
  */

/** @defgroup MDF_SadDataMemoryTransfer MDF sound activity detector data memory transfer mode
  * @{
  */
#define MDF_SAD_NO_MEMORY_TRANSFER         0x00000000U         /*!< No memory transfer */
#define MDF_SAD_MEMORY_TRANSFER_IN_DETECT  MDF_SADCR_DATCAP_0  /*!< Memory transfer only in detect state */
#define MDF_SAD_MEMORY_TRANSFER_ALWAYS     MDF_SADCR_DATCAP    /*!< Memory transfer always */
/**
  * @}
  */

/** @defgroup MDF_SadHangoverWindow MDF sound activity detector data hangover time window
  * @{
  */
#define MDF_SAD_HANGOVER_4_FRAMES    0x00000000U              /*!< Hangover window of 4 frames */
#define MDF_SAD_HANGOVER_8_FRAMES    MDF_SADCFGR_HGOVR_0      /*!< Hangover window of 8 frames */
#define MDF_SAD_HANGOVER_16_FRAMES   MDF_SADCFGR_HGOVR_1      /*!< Hangover window of 16 frames */
#define MDF_SAD_HANGOVER_32_FRAMES  (MDF_SADCFGR_HGOVR_0 | \
                                     MDF_SADCFGR_HGOVR_1)     /*!< Hangover window of 32 frames */
#define MDF_SAD_HANGOVER_64_FRAMES   MDF_SADCFGR_HGOVR_2      /*!< Hangover window of 64 frames */
#define MDF_SAD_HANGOVER_128_FRAMES (MDF_SADCFGR_HGOVR_0 | \
                                     MDF_SADCFGR_HGOVR_2)     /*!< Hangover window of 128 frames */
#define MDF_SAD_HANGOVER_256_FRAMES (MDF_SADCFGR_HGOVR_1 | \
                                     MDF_SADCFGR_HGOVR_2)     /*!< Hangover window of 256 frames */
#define MDF_SAD_HANGOVER_512_FRAMES (MDF_SADCFGR_HGOVR_0 | \
                                     MDF_SADCFGR_HGOVR_1 | \
                                     MDF_SADCFGR_HGOVR_2)     /*!< Hangover window of 512 frames */
/**
  * @}
  */

/** @defgroup MDF_SadLearningFrames MDF sound activity detector data learning frames
  * @{
  */
#define MDF_SAD_LEARNING_2_FRAMES   0x00000000U                                 /*!< 2 learning frames */
#define MDF_SAD_LEARNING_4_FRAMES   MDF_SADCFGR_LFRNB_0                         /*!< 4 learning frames */
#define MDF_SAD_LEARNING_8_FRAMES   MDF_SADCFGR_LFRNB_1                         /*!< 8 learning frames */
#define MDF_SAD_LEARNING_16_FRAMES (MDF_SADCFGR_LFRNB_0 | MDF_SADCFGR_LFRNB_1)  /*!< 16 learning frames */
#define MDF_SAD_LEARNING_32_FRAMES  MDF_SADCFGR_LFRNB                           /*!< 32 learning frames */
/**
  * @}
  */

/** @defgroup MDF_SadSignalNoiseThreshold MDF sound activity detector data signal to noise threshold
  * @{
  */
#define MDF_SAD_SIGNAL_NOISE_3_5DB   0x00000000U              /*!< Signal to noise threshold is 3.5dB */
#define MDF_SAD_SIGNAL_NOISE_6DB     MDF_SADCFGR_SNTHR_0      /*!< Signal to noise threshold is 6dB */
#define MDF_SAD_SIGNAL_NOISE_9_5DB   MDF_SADCFGR_SNTHR_1      /*!< Signal to noise threshold is 9.5dB */
#define MDF_SAD_SIGNAL_NOISE_12DB   (MDF_SADCFGR_SNTHR_0 | \
                                     MDF_SADCFGR_SNTHR_1)     /*!< Signal to noise threshold is 12dB */
#define MDF_SAD_SIGNAL_NOISE_15_6DB  MDF_SADCFGR_SNTHR_2      /*!< Signal to noise threshold is 15.6dB */
#define MDF_SAD_SIGNAL_NOISE_18DB   (MDF_SADCFGR_SNTHR_0 | \
                                     MDF_SADCFGR_SNTHR_2)     /*!< Signal to noise threshold is 18dB */
#define MDF_SAD_SIGNAL_NOISE_21_6DB (MDF_SADCFGR_SNTHR_1 | \
                                     MDF_SADCFGR_SNTHR_2)     /*!< Signal to noise threshold is 21.6dB */
#define MDF_SAD_SIGNAL_NOISE_24_1DB (MDF_SADCFGR_SNTHR_0 | \
                                     MDF_SADCFGR_SNTHR_1 | \
                                     MDF_SADCFGR_SNTHR_2)     /*!< Signal to noise threshold is 24.1dB */
#define MDF_SAD_SIGNAL_NOISE_27_6DB  MDF_SADCFGR_SNTHR_3      /*!< Signal to noise threshold is 27.6dB */
#define MDF_SAD_SIGNAL_NOISE_30_1DB (MDF_SADCFGR_SNTHR_0 | \
                                     MDF_SADCFGR_SNTHR_3)     /*!< Signal to noise threshold is 30.1dB */
/**
  * @}
  */

/** @defgroup MDF_FilterTriggerSource MDF filter trigger source
  * @{
  */
#define MDF_FILTER_TRIG_TRGO         0x00000000U
#define MDF_FILTER_TRIG_OLD_EVENT    MDF_DFLTCR_TRGSRC_0      /*!< @note Not available for ADF instance */
#define MDF_FILTER_TRIG_TIM1_TRGO2   MDF_DFLTCR_TRGSRC_1      /*!< @note Not available for ADF instance */
#define MDF_FILTER_TRIG_TIM8_TRGO2  (MDF_DFLTCR_TRGSRC_0 | \
                                     MDF_DFLTCR_TRGSRC_1)     /*!< @note Not available for ADF instance */
#define MDF_FILTER_TRIG_TIM20_TRGO2  MDF_DFLTCR_TRGSRC_2      /*!< @note Not available for ADF instance */
#define MDF_FILTER_TRIG_TIM16_OC1   (MDF_DFLTCR_TRGSRC_0 | \
                                     MDF_DFLTCR_TRGSRC_2)     /*!< @note Not available for ADF instance */
#define MDF_FILTER_TRIG_TIM6_TRGO   (MDF_DFLTCR_TRGSRC_1 | \
                                     MDF_DFLTCR_TRGSRC_2)     /*!< @note Not available for ADF instance */
#define MDF_FILTER_TRIG_TIM7_TRGO   (MDF_DFLTCR_TRGSRC_0 | \
                                     MDF_DFLTCR_TRGSRC_1 | \
                                     MDF_DFLTCR_TRGSRC_2)     /*!< @note Not available for ADF instance */
#define MDF_FILTER_TRIG_EXTI11       MDF_DFLTCR_TRGSRC_3      /*!< @note Not available for ADF instance */
#define MDF_FILTER_TRIG_EXTI15      (MDF_DFLTCR_TRGSRC_0 | \
                                     MDF_DFLTCR_TRGSRC_3)     /*!< @note Not available for ADF instance */
#define MDF_FILTER_TRIG_LPTIM1_CH1  (MDF_DFLTCR_TRGSRC_1 | \
                                     MDF_DFLTCR_TRGSRC_3)     /*!< @note Not available for ADF instance */
#define MDF_FILTER_TRIG_LPTIM2_CH1  (MDF_DFLTCR_TRGSRC_0 | \
                                     MDF_DFLTCR_TRGSRC_1 | \
                                     MDF_DFLTCR_TRGSRC_3)     /*!< @note Not available for ADF instance */
#define MDF_FILTER_TRIG_LPTIM3_CH1  (MDF_DFLTCR_TRGSRC_2 | \
                                     MDF_DFLTCR_TRGSRC_3)     /*!< @note Not available for ADF instance */
#define MDF_FILTER_TRIG_ADF_TRGO    (MDF_DFLTCR_TRGSRC_0 | \
                                     MDF_DFLTCR_TRGSRC_2 | \
                                     MDF_DFLTCR_TRGSRC_3)
#define MDF_FILTER_TRIG_ADF_SAD_DET (MDF_DFLTCR_TRGSRC_1 | \
                                     MDF_DFLTCR_TRGSRC_2 | \
                                     MDF_DFLTCR_TRGSRC_3)     /*!< @note Not available for ADF instance */

