zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_mdf.h
/* Generic functions  *********************************************************/
/** @addtogroup MDF_Exported_Functions_Group6
  * @{
  */
void                 HAL_MDF_IRQHandler(MDF_HandleTypeDef *hmdf);
void                 HAL_MDF_ErrorCallback(MDF_HandleTypeDef *hmdf);
HAL_MDF_StateTypeDef HAL_MDF_GetState(const MDF_HandleTypeDef *hmdf);
uint32_t             HAL_MDF_GetError(const MDF_HandleTypeDef *hmdf);
/**
  * @}
  */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup MDF_Private_Macros  MDF Private Macros
  * @{
  */
#if defined(MDF1)
#define IS_MDF_INSTANCE(PARAM) (((PARAM) == MDF1_Filter0) || \
                                ((PARAM) == MDF1_Filter1) || \
                                ((PARAM) == MDF1_Filter2) || \
                                ((PARAM) == MDF1_Filter3) || \
                                ((PARAM) == MDF1_Filter4) || \
                                ((PARAM) == MDF1_Filter5) || \
                                ((PARAM) == MDF1_Filter6) || \
                                ((PARAM) == MDF1_Filter7))
#else
#define IS_MDF_INSTANCE(PARAM) (0 == 1)
#endif /* MDF1 */

#define IS_ADF_INSTANCE(PARAM) ((PARAM) == ADF1_Filter0)

#define IS_MDF_FILTER_BITSTREAM(PARAM) (((PARAM) == MDF_BITSTREAM0_RISING)  || \
                                        ((PARAM) == MDF_BITSTREAM0_FALLING) || \
                                        ((PARAM) == MDF_BITSTREAM1_RISING)  || \
                                        ((PARAM) == MDF_BITSTREAM1_FALLING) || \
                                        ((PARAM) == MDF_BITSTREAM2_RISING)  || \
                                        ((PARAM) == MDF_BITSTREAM2_FALLING) || \
                                        ((PARAM) == MDF_BITSTREAM3_RISING)  || \
                                        ((PARAM) == MDF_BITSTREAM3_FALLING) || \
                                        ((PARAM) == MDF_BITSTREAM4_RISING)  || \
                                        ((PARAM) == MDF_BITSTREAM4_FALLING) || \
                                        ((PARAM) == MDF_BITSTREAM5_RISING)  || \
                                        ((PARAM) == MDF_BITSTREAM5_FALLING) || \
                                        ((PARAM) == MDF_BITSTREAM6_RISING)  || \
                                        ((PARAM) == MDF_BITSTREAM6_FALLING) || \
                                        ((PARAM) == MDF_BITSTREAM7_RISING)  || \
                                        ((PARAM) == MDF_BITSTREAM7_FALLING))

#define IS_MDF_INTERLEAVED_FILTERS(PARAM) ((PARAM) <= 7U)

#define IS_MDF_PROC_CLOCK_DIVIDER(PARAM) ((1U <= (PARAM)) && ((PARAM) <= 128U))

#define IS_MDF_OUTPUT_CLOCK_PINS(PARAM) (((PARAM) == MDF_OUTPUT_CLOCK_0) || \
                                         ((PARAM) == MDF_OUTPUT_CLOCK_1) || \
                                         ((PARAM) == MDF_OUTPUT_CLOCK_ALL))

#define IS_MDF_OUTPUT_CLOCK_DIVIDER(PARAM) ((1U <= (PARAM)) && ((PARAM) <= 16U))

#define IS_MDF_OUTPUT_CLOCK_TRIGGER_SOURCE(PARAM) (((PARAM) == MDF_CLOCK_TRIG_TRGO)       || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_TIM1_TRGO2) || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_TIM8_TRGO2) || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_TIM20_TRGO2)|| \
                                                   ((PARAM) == MDF_CLOCK_TRIG_TIM16_OC1)  || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_TIM6_TRGO)  || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_TIM7_TRGO)  || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_EXTI11)     || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_EXTI15)     || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_LPTIM1_CH1) || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_LPTIM2_CH1) || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_LPTIM3_CH1) || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_SAD_TRGO)   || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_SAD_DET))

#define IS_ADF_OUTPUT_CLOCK_TRIGGER_SOURCE(PARAM) (((PARAM) == MDF_CLOCK_TRIG_TRGO)       || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_EXTI1))

#define IS_MDF_OUTPUT_CLOCK_TRIGGER_EDGE(PARAM) (((PARAM) == MDF_CLOCK_TRIG_RISING_EDGE) || \
                                                 ((PARAM) == MDF_CLOCK_TRIG_FALLING_EDGE))

#define IS_MDF_SITF_MODE(PARAM) (((PARAM) == MDF_SITF_LF_MASTER_SPI_MODE)      || \
                                 ((PARAM) == MDF_SITF_NORMAL_SPI_MODE)         || \
                                 ((PARAM) == MDF_SITF_MANCHESTER_FALLING_MODE) || \
                                 ((PARAM) == MDF_SITF_MANCHESTER_RISING_MODE))

#define IS_MDF_SITF_CLOCK_SOURCE(PARAM) (((PARAM) == MDF_SITF_CCK0_SOURCE) || \
                                         ((PARAM) == MDF_SITF_CCK1_SOURCE) || \
                                         ((PARAM) == MDF_SITF_CKI_SOURCE))

#define IS_MDF_SITF_THRESHOLD(PARAM) ((4U <= (PARAM)) && ((PARAM) <= 31U))

#define IS_MDF_CIC_MODE(PARAM) (((PARAM) == MDF_TWO_FILTERS_MCIC_FASTSINC) || \
                                ((PARAM) == MDF_TWO_FILTERS_MCIC_SINC1)    || \
                                ((PARAM) == MDF_TWO_FILTERS_MCIC_SINC2)    || \
                                ((PARAM) == MDF_TWO_FILTERS_MCIC_SINC3)    || \
                                ((PARAM) == MDF_ONE_FILTER_SINC4)          || \
                                ((PARAM) == MDF_ONE_FILTER_SINC5))

#define IS_ADF_CIC_MODE(PARAM) (((PARAM) == MDF_ONE_FILTER_SINC4) || \
                                ((PARAM) == MDF_ONE_FILTER_SINC5))

#define IS_MDF_ACQUISITION_MODE(PARAM) (((PARAM) == MDF_MODE_ASYNC_CONT)   || \
                                        ((PARAM) == MDF_MODE_ASYNC_SINGLE) || \
                                        ((PARAM) == MDF_MODE_SYNC_CONT)    || \
                                        ((PARAM) == MDF_MODE_SYNC_SINGLE)  || \
                                        ((PARAM) == MDF_MODE_WINDOW_CONT)  || \
                                        ((PARAM) == MDF_MODE_SYNC_SNAPSHOT))

#define IS_ADF_ACQUISITION_MODE(PARAM) (((PARAM) == MDF_MODE_ASYNC_CONT)   || \
                                        ((PARAM) == MDF_MODE_ASYNC_SINGLE) || \
                                        ((PARAM) == MDF_MODE_SYNC_CONT)    || \
                                        ((PARAM) == MDF_MODE_SYNC_SINGLE)  || \
                                        ((PARAM) == MDF_MODE_WINDOW_CONT))

#define IS_MDF_DISCARD_SAMPLES(PARAM) ((PARAM) <= 255U)

#define IS_MDF_FIFO_THRESHOLD(PARAM) (((PARAM) == MDF_FIFO_THRESHOLD_NOT_EMPTY) || \
                                      ((PARAM) == MDF_FIFO_THRESHOLD_HALF_FULL))

